/*!
 *  (C) 2010 Tom Brinkman
 *
 * Use, modification and distribution is subject to the accompanying license file LICENSE_1_0.txt, Version 1.0.
 * (See http://www.reportbase.com/LICENSE_1_0.txt)
 *
 * \file   util.hpp
 * \brief  C Utility functions
 */

#ifndef __UTIL_HPP__
#define __UTIL_HPP__

#include <sys/types.h>
#include <sys/stat.h>
#include <sys/mman.h>
#include <sys/ipc.h>
#include <sys/shm.h>
#include <sys/wait.h>
#include <stdarg.h>
#include <cmath>
#include <stdint.h>
#include <limits>
#include <stdlib.h>
#include <fcntl.h>
#include <stdio.h>
#include <time.h>
#include <math.h>
#include <errno.h>
#include <ctype.h>
#include <stdio.h>
#include <string.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <stdlib.h>
#include <errno.h>
#include <time.h>
#include <unistd.h>
#include <libgen.h>
#include <functional>
#include <sys/types.h>
#include <sys/stat.h>
#include <dirent.h>
#include <errno.h>
#include <syslog.h>
#include <algorithm>
#include <float.h>
#include <memory>
#include <fnmatch.h>
#include <functional>
#include <map>
#include <opencv/cv.h>
#include <opencv/cvaux.h>
#include <opencv/highgui.h>
#include <regex.h>
#include "pod.hpp"
#include "echo.hpp"
#include "rgb.hpp"

#define JOIN24(R,G,B) R << 16 | G << 8 | B
#define JOIN32(R,G,B,A) A << 24 | R << 16 | G << 8 | B
#define JOIN4(K) K[0] << 24 | K[1] << 16 | K[2] << 8 | K[3]
#define MIN3(x,y,z)  ((y) <= (z) ?  ((x) <= (y) ? (x) : (y)) : ((x) <= (z) ? (x) : (z)))

static const unsigned int        MAX_SIZE = 0x1 << 8; //256
static const unsigned int        BEKVALUES = 0x1 << 6; //64
static const unsigned int        SECONDS_PER_DAY = 86400;
static const unsigned int        OPTION_FLAG_DEFAULT = 0x1 << 0; //1
static const unsigned int        OPTION_FLAG_IN_MAIN = 0x1 << 1; //2
static const unsigned int        OPTION_FLAG_REVERSE = 0x1 << 2; //4
static const unsigned int        OPTION_FLAG_NO_ARG = 0x1 << 3; //8
static const unsigned int        OPTION_FLAG_FILENAME = 0x1 << 4; //16
static const unsigned int        OPTION_FLAG_OPTIONAL_ARG = 0x1 << 5; //32
static const unsigned int        OPTION_FLAG_NOALIAS = 0x1 << 6; //64
static const unsigned int        OPTION_FLAG_DUAL_ARG = 0x1 << 7; //128
static const unsigned int        OPTION_FLAG_TRIP_ARG = 0x1 << 8; //256
static const unsigned int        OPTION_FLAG_HIDDEN = 0x1 << 9; //512
static const unsigned int        OPTION_FLAG_ARG2_OPTIONAL = 0x1 << 10; //1024
static const unsigned int        YOHLCV_SIZE = 7;
static const unsigned int        LEFT = 0x1 << 1;//2
static const unsigned int        CENTER = 0x1 << 2;//4
static const unsigned int        RIGHT = 0x1 << 3;//8
static const unsigned int        TOP = 0x1 << 4;//16
static const unsigned int        MIDDLE = 0x1 << 5;//32
static const unsigned int        HALFCENTER = 0x1 << 6; //64
static const unsigned int        BOTTOM = 0x1 << 7;//128
static const unsigned int        HALFBOTTOM = 0x1 << 8; //256
static const unsigned int        HALFPUSH = 0x1 << 10; //1024
static const unsigned int        HORIZONTAL = 0x1 << 11; //2056
static const unsigned int        HALFTOP = 0x1 << 12; //4096
static const unsigned int        OFFSET1 = 0x1 << 13;
static const unsigned int        NOCLIP = 0x1 << 14;
static const unsigned int        UPPER = 0x1 << 1;
static const int                 GIA_MAX = 500;
static const int                 SYMBOL_MAX = 5000;
static const int                 FIRSTLAYOUT = 440;
extern const char*               APPLICATION;
extern const char*               WEBSITE;
extern const char*               SUMMARY;
extern const char*               EXAMPLE;
extern const char*               USAGE;
extern const int                 MAJORVERSION;
extern const int                 MINORVERSION;
extern const int                 PATCHVERSION;
extern int*                      VERBOSE;
extern int*                      GIAWIDTH;
extern int*                      GIAHEIGHT;
extern int*                      AVAHEIGHT;
extern int*                      ZOEWIDTH;
extern int*                      FLOHEIGHT;
extern int*                      CHARTHEIGHT;
extern int*                      METASET;

#ifdef DEBUG
#define FPRINTF(fd, ...) fprintf (fd, __VA_ARGS__)
#define SPRINTF(path, ...) sprintf(path, __VA_ARGS__);
#define FREOPEN(path, fd) fd = freopen(path, "w", fd);
#define FCLOSE(fd) fclose(fd);
#define WRITEF(fd, ...) writef(fd, __VA_ARGS__);
#else
#define FPRINTF(fd, ...)
#define SPRINTF(path, ...)
#define FREOPEN(path, fd)
#define FCLOSE(fd)
#define WRITEF(fd, ...)
#endif

enum class option_type
{
    none,
    string,
    integer,
    flag,
    callback,
    system,
    filename,
    string_array,
    filename_array,
    decimal,
    integer64,
};

enum
{
    IMAGE_LAYOUT,//0
    IMAGE_HELP,//1
    IMAGE_HAL,//2
    IMAGE_IND,//3
    IMAGE_SIZE
};

enum
{
    COLOR_LINE1,
    COLOR_LINE2,
    COLOR_LINE3,
    COLOR_ZOESCROLLBACK,
    COLOR_ZOENUBACK,
    COLOR_BEKSCROLLBACK,
    COLOR_BEKNUBACK,
    COLOR_IMAGEBACK,
    COLOR_AVATEXT,
    COLOR_AVATEXTBK,
    COLOR_SIZE
};

enum
{
    SUNDAY,
    MONDAY,
    TUESDAY,
    WEDNESDAY,
    THURSDAY,
    FRIDAY,
    SATURDAY
};

enum
{
    STATE_DEFAULT,
    STATE_CURRENT,
    STATE_SELECTED,
    STATE_ENABLED,
    STATE_SELECTEDCURRENT,
    STATE_SELECTEDENABLED,
    STATE_CURRENTENABLED,
    STATE_SELECTEDCURRENTENABLED,
    STATE_SIZE
};

enum
{
    FEEDTYPE_ROC,
    FEEDTYPE_FI,
    FEEDTYPE_DPO,
    FEEDTYPE_AVG,
    FEEDTYPE_DIFF,
    FEEDTYPE_DIV,
    FEEDTYPE_AVG3,
    FEEDTYPE_TR,
    FEEDTYPE_TL,
    FEEDTYPE_RC,
    FEEDTYPE_FC,
    FEEDTYPE_AVG4,
    FEEDTYPE_CLV,
    FEEDTYPE_OBV,
    FEEDTYPE_WMA,
    FEEDTYPE_EMA,
    FEEDTYPE_SMA,
    FEEDTYPE_MIN,
    FEEDTYPE_MAX,
    FEEDTYPE_MULT,
    FEEDTYPE_MULTC,
    FEEDTYPE_SUB,
    FEEDTYPE_SUBC,
    FEEDTYPE_ADD,
    FEEDTYPE_ADDC,
    FEEDTYPE_RS,
    FEEDTYPE_STDEV,
    FEEDTYPE_CCI,
    FEEDTYPE_ULTOSC,
    FEEDTYPE_NDM,
    FEEDTYPE_PDM,
    FEEDTYPE_ACCDIST,
    FEEDTYPE_CMF,
    FEEDTYPE_BOL,
    FEEDTYPE_BOLL_PER,
    FEEDTYPE_STOCH,
    FEEDTYPE_WILL_PER,
    FEEDTYPE_PVT,
    FEEDTYPE_STOCHRSI,
    FEEDTYPE_MFR,
    FEEDTYPE_PSYLINE,
    FEEDTYPE_INDEX,
    FEEDTYPE_DEFAULT,
    FEEDTYPE_SIZE,
};

enum
{
    FEEDGROUP_1,
    FEEDGROUP_2,
    FEEDGROUP_3,
    FEEDGROUP_4,
    FEEDGROUP_5,
    FEEDGROUP_6,
};

enum
{
    FEED_YMD,
    FEED_OPEN,
    FEED_HIGH,
    FEED_LOW,
    FEED_CLOSE,
    FEED_VOLUME,
    FEED_UNUSED100,
    FEED_CHANGE,
    FEED_ROC,
    FEED_TL,
    FEED_TP,
    FEED_TPA16,
    FEED_CCI16,
    FEED_FI,
    FEED_WC,
    FEED_CLV,
    FEED_RS14,
    FEED_CLOSESMA16,
    FEED_CLOSESMA50,
    FEED_CLOSESMA16PENV,
    FEED_CLOSESMA16NENV,
    FEED_CLOSEEMA12,
    FEED_CLOSEEMA16,
    FEED_CLOSEEMA26,
    FEED_CLOSEEMA32,
    FEED_TYPICALPRICESMA16,
    FEED_TYPICALPRICESMA32,
    FEED_CLOSEROC16,
    FEED_CLOSSEROC8,
    FEED_VOLUMEEMA16,
    FEED_VOLUMEEMA32,
    FEED_RSI14,
    FEED_LOW16,
    FEED_HIGH16,
    FEED_RMF,
    FEED_BP,
    FEED_CLOSESTDEV16,
    FEED_DPO16,
    FEED_APO1632,
    FEED_UNUSED101,
    FEED_PPO1632,
    FEED_MACD1226,
    FEED_UNUSED102,
    FEED_ACCDIST,
    FEED_ACCDISTEMA3,
    FEED_ACCDISTEMA10,
    FEED_CHAIKINOSCILL310,
    FEED_MEAN,
    FEED_PVOSIGNAL16329,
    FEED_PPOSIGNAL16329,
    FEED_STOCHRSI,
    FEED_FIEMA16,
    FEED_MOM10,
    FEED_ONBALANCEVOLUME,
    FEED_MACDSIGNAL12269,
    FEED_STOCH16,
    FEED_STOCHSMA163,
    FEED_STOCHSMA1633,
    FEED_STDEVSMA16,
    FEED_UPPERBOLLINGER1616,
    FEED_LOWERBOLLINGER1616,
    FEED_BOLLINGER1616,
    FEED_BOLLWIDTH1616,
    FEED_MACDHIST12269,
    FEED_WILLIAMSPERC1616,
    FEED_UNUSED103,
    FEED_MFI14,
    FEED_TRUERANGE,
    FEED_UNUSED104,
    FEED_UNUSED105,
    FEED_UNUSED106,
    FEED_UNUSED107,
    FEED_UNUSED108,
    FEED_TEST,
    FEED_UNUSED109,
    FEED_UNUSED110,
    FEED_SIZE
};

enum
{
    GRAPH_RSI14,
    GRAPH_MA50CANDLE,
    GRAPH_MACD12269,
    GRAPH_HIGHAREA,
    GRAPH_HIGHBARS,
    GRAPH_VOLUMELINE,
    GRAPH_MA1632OHLC2,
    GRAPH_MA1632OHLC,
    GRAPH_UNUSED,
    GRAPH_MA1632HLC,
    GRAPH_PPO16329,
    GRAPH_ROC16,
    GRAPH_WILLIAMS16,
    GRAPH_OBV,
    GRAPH_CMF,
    GRAPH_MFI15,
    GRAPH_FI,
    GRAPH_TR,
    GRAPH_BOLLINGER1616,
    GRAPH_BOLPERC,
    GRAPH_BOLLWIDTH,
    GRAPH_STDEV,
    GRAPH_ACCDIST,
    GRAPH_PVO4,
    GRAPH_CHAIKINOSCILL310,
    GRAPH_STOCHRSI1,
    GRAPH_FASTSTO,
    GRAPH_SLOWSTO,
    GRAPH_SMAENV,
    GRAPH_KELTNERUP,
    GRAPH_PRICECHAN16,
    GRAPH_ATR,
    GRAPH_CCI16,
    GRAPH_ULTOSC,
    GRAPH_DPO,
    GRAPH_MA50CANDLE10,
    GRAPH_SIZE
};

enum
{
    METASET_TINY,
    METASET_SMALL,
    METASET_MEDIUM,
    METASET_MEDIUM_LARGE,
    METASET_LARGE,
    METASET_VER_LARGE,
    METASET_HUGE,
    METASET_SIZE
};

struct point
{
    int x;
    int y;
};

typedef pod<point> point_t;

struct fundamental
{
    char symbol[NAME_SIZE];//0
    char name[NAME_SIZE];//1
    char sector[NAME_SIZE];//2
    char industry[NAME_SIZE];//3
    char pe[NAME_SIZE];//4
    char eps[NAME_SIZE];//5
    char divyield[NAME_SIZE];//6
    char shares[NAME_SIZE];//7
    char dps[NAME_SIZE];//8
    char peg[NAME_SIZE];//9
    char pts[NAME_SIZE];//10
    char ptb[NAME_SIZE];//11
};

struct ind
{
    char name[NAME_SIZE];
    char title[TITLE_SIZE];
};

struct technical
{
    char symbol[NAME_SIZE];//0
    char previous[NAME_SIZE];//1
    char change[NAME_SIZE];//2
    char volumechange[NAME_SIZE];//3
    char weekhigh[NAME_SIZE];//4
    char weeklow[NAME_SIZE];//5
    char weekchange[NAME_SIZE];//6
    char avgweekchange[NAME_SIZE];//7
    char avgweekvolume[NAME_SIZE];//8
    char monthhigh[NAME_SIZE];//9
    char monthlow[NAME_SIZE];//10
    char monthchange[NAME_SIZE];//11
    char avgmonthchange[NAME_SIZE];//12
    char avgmonthvolume[NAME_SIZE];//13
    char yearhigh[NAME_SIZE];//14
    char yearlow[NAME_SIZE];//15
    char yearchange[NAME_SIZE];//16
    char avgyearchange[NAME_SIZE];//17
    char avgyearvolume[NAME_SIZE];//18
    char ma5[NAME_SIZE];//19
    char ma20[NAME_SIZE];//20
    char ma50[NAME_SIZE];//21
    char ma100[NAME_SIZE];//22
    char ma200[NAME_SIZE];//23
    char rsi14[NAME_SIZE];//24
    char sto9[NAME_SIZE];//25
    char wpr14[NAME_SIZE];//26
    char mtm14[NAME_SIZE];//27
    char roc14[NAME_SIZE];//28
    char ptc[NAME_SIZE];//29
};

struct color
{
    char name[LABEL_SIZE];
    int red;
    int green;
    int blue;
    int hue;
    int sat;
    int val;
};

struct rectangle
{
    short x;
    short y;
    short width;
    short height;
};

typedef pod<rectangle> rectangle_t;

struct message
{
    int domain;
    int code;
    char file[MAX_PATH];
    char function[MAX_PATH];
    int line;
    int fatal;
    char* message;
};

struct image
{
    int width;
    int height;
    int channels;
    int left;
    int right;
    int top;
    int bottom;
    unsigned char* data;
};

extern const image* EMAIMAGE;
extern const image* FLOIMAGE;
extern const image* ZOEIMAGE;
extern const char*  EXCHANGE;

typedef pod<image> image_t;

struct imageptr
{
    image** img;
    int size;
};

template <typename type_t>
struct array
{
    type_t* data;
    int size;
};

template <typename type_t>
struct node
{
    type_t data;
    node<type_t>* next;
};

template <typename type_t>
struct queue
{
